Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/paternity_benefit.html.txt.tmx
Source language: en
Languages: ga

source: You upload your application form and supporting documentation (form PB2 for employees and form PB3 if you're self-employed) and submit them online
ga: Déanann tú do cháipéisíocht tacaíochta a uaslódáil agus seolann tú ar aghaidh í le d’iarratas

source: You must have a Public Services Card (linked to your mobile phone number) and a verified MyGovID account to apply online
ga: Caithfidh Cárta Seirbhísí Poiblí a bheith agat chun iarratas a dhéanamh ar Shochar Atharthachta

source: If you do not already have a Public Services Card, you can make an appointment to get one at mywelfare.ie
ga: Mura bhfuil Cárta Seirbhísí Poiblí agat cheana féin, féadfaidh tú coinne a dhéanamh chun ceann a fháil ag mywelfare.ie

source: You will first need to register with the site
ga: Beidh ort clárú leis an láithreán ar dtús

source: To do this you need a mobile phone number and 2 e-mail addresses (a main address and an alternate address)
ga: Chun seo a dhéanamh, teastaíonn uimhir ghuthán póca agus dhá sheoladh ríomhphoist uait (príomhsheoaldh ríomhphoist agus seoladh eile ríomhphoist)

source: When you have made your appointment, print the notification and bring it to your appointment along with the required documents (listed in the notification). Postal application
ga: Nuair a bheidh do choinne déanta, priontáil an fógra agus tabhair leat é chuig do choinne anuas ar na cáipéisí a theastaíonn (a liostaítear san fhógra)

source: You can email the Paternity Benefit section using the secure enquiry form
ga: Féadfaidh tú ríomhphost a sheoladh chuig an Rannóg Sochar Atharthachta tríd an bhfoirm fiosrúcháin shláin a úsáid

source: If your baby is born prematurely (before your Paternity Leave and Paternity Benefit is due to begin) and you wish to change your leave dates, you should send a letter from your employer confirming the new leave dates and the date of birth of your child to the Paternity Benefit section of the Department of Social Protection
ga: Má shaolaítear do leanbh go réamhaibí (sula mbíonn do Shaoire Atharthachta agus do Shochar Atharthachta dlite le tosú) agus más mian leat do dhátaí saoire a athrú, ba cheart duit litir a sheoladh ó d’fhostóir ina ndeimhnítear na dátaí nua saoire agus dáta breithe do linbh chuig an Rannóg Sochar Atharthachta den Roinn Coimirce Sóisialaí

source: If you are self-employed you must send a letter to the Paternity Benefit section stating your new leave dates and a letter from a doctor or the hospital confirming the date of birth of your child
ga: Má tá tú féinfhostaithe, caithfidh tú litir a sheoladh chuig an Rannóg Sochar Atharthachta ina luaitear do dhátaí nua saoire, anuas ar litir ó dhochtúir nó ón ospidéal ina ndeimhnítear dáta breithe do linbh

source: If there is a stillbirth or miscarriage any time after the 24th week of pregnancy (i.e
ga: Má tharlaíonn marbh-bhreith nó breith anabaí ag aon tráth i ndiaidh an 24ú seachtain de thoircheas (i.e

source: from the beginning of the 25th week) and you are entitled to paternity leave, you are entitled to 2 weeks Paternity Benefit provided you satisfy the social insurance (PRSI) requirements
ga: ó thús an 25ú seachtain) agus má tá tú i dteideal saoire atharthachta a ghlacadh, beidh tú i dteideal 2 sheachtain de Shochar Atharthachta a fháil a fhad agus a shásaíonn tú na riachtanais árachais shóisialaigh (ÁSPC)

source: To apply for Paternity Benefit following a stillbirth, you need to send a letter from your doctor with the Paternity Benefit application form, confirming the expected date of birth, the actual date of birth and the number of weeks of pregnancy
ga: Chun iarratas a dhéanamh ar Shochar Atharthachta i ndiaidh marbh-bhreithe, is gá duit litir a sheoladh ó do dhochtúir i dteannta na foirme iarratais ar Shochar Atharthachta, ina ndeimhnítear an dáta a bhfuil súil leis go saolófar an leanbh, an dáta féin breithe agus líon seachtainí an toirchis

source: The leave must still be certified by your employer or self-certified if you are self-employed
ga: Caithfidh d’fhostóir an tsaoire a dheimhniú go fóill nó caithfidh an tsaoire a bheith féindeimhnithe má tá tú féinfhostaithe

source: If your baby is in hospital you can postpone your paternity leave and Paternity Benefit or whatever portion of it remains for a maximum of 6 months
ga: Má tá do leanbh in ospidéal, féadfaidh tú do shaoire atharthachta agus do Shochar Atharthachta nó pé cuid díobh nár ghlac tú/nach bhfuair tú a chur siar ar feadh 6 mhí, ar a mhéid

source: If you are an employee and you wish to change your leave dates because of the hospitalisation of your baby, you should send a letter from your employer confirming the new leave dates to the Paternity Benefit section of the Department of Social Protection
ga: Más fostaí thú agus más mian leat do dhátaí saoire a athrú mar gheall gur tugadh do leanbh chun ospidéil, ba cheart duit litir a sheoladh ó d’fhostóir ina ndeimhnítear na dátaí nua saoire chuig an Rannóg Sochar Atharthachta den Roinn Coimirce Sóisialaí

source: If you are self-employed and you wish to change your leave dates because of the hospitalisation of your baby, you must send a letter to the Paternity Benefit section stating your new leave dates and a letter from a doctor or the hospital confirming the date of birth of your child
ga: Má tá tú féinfhostaithe agus más mian leat do dhátaí saoire a athrú mar gheall gur tugadh do leanbh chun ospidéil, caithfidh tú litir a sheoladh chuig an Rannóg Sochar Atharthachta ina luaitear do dhátaí nua saoire, anuas ar litir ó dhochtúir nó ón ospidéal ina ndeimhnítear dáta breithe do linbh
